# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# Employs Ghost convolutions and modules proposed in Huawei's GhostNet in https://arxiv.org/abs/1911.11907v2

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
max_channels: 1024 #max channel

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv8.0n-ghost backbone
backbone:
  # [from, repeats, module, args]
  # update this
  - [-1, 1, conv_bn_relu_maxpool, [64]]  # 0-P1/2 Conv, BN, ReLU, maxpool
  - [-1, 1, ShuffleNetV2_InvertedResidual, [128, 2]]  # 1-P2/4 dm
  - [-1, 3, ShuffleNetV2_InvertedResidual, [128, 1]] # 2 shufflenetv2 bm
  - [-1, 1, ShuffleNetV2_InvertedResidual, [256, 2]]  # 3-p3 s2 dm
  - [-1, 7, ShuffleNetV2_InvertedResidual, [256, 1]] # 4 s2 bm
  - [-1, 1, ShuffleNetV2_InvertedResidual, [512, 2]]  # 5-P4/16 s2 dm
  - [-1, 3, ShuffleNetV2_InvertedResidual, [512, 1]] # 6 s2 bm
  - [-1, 1, conv_bn_relu_maxpool, [1024]]  # 7-p5 Conv, BN, ReLU, channel changed based on ori YOLOv8

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 10

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 13 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 16 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 19 (P5/32-large)

  - [[13, 16, 19], 1, Detect, [nc]]  # Detect(P3, P4, P5)
